1s/ERP/Conf/Catalogs/Лико_НастройкиУчетаПроизводственныхЗатрат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Лико_НастройкиУчетаПроизводственныхЗатрат</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выключить</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазаРаспределения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыРаботСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазаРаспределенияКоэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_СтатьиЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РабочиеЦентры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РабочийЦентр</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РабочиеЦентры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

1s/ERP/Conf/Catalogs/Лико_НастройкиУчетаПроизводственныхЗатрат/Ext/ManagerModule.bsl
Функция РаспределяемыеМатериалы(Организация,РабочийЦентр,Дата) Экспорт  //+Лико m.shenderov 30.11.2018
УстановитьПривилегированныйРежим(Истина);	


	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_НастройкиУчетаПроизводственныхЗатратРабочиеЦентры.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Лико_НастройкиУчетаПроизводственныхЗатрат.РабочиеЦентры КАК Лико_НастройкиУчетаПроизводственныхЗатратРабочиеЦентры
	|ГДЕ
	|	НЕ Лико_НастройкиУчетаПроизводственныхЗатратРабочиеЦентры.Ссылка.Выключить
	|	И Лико_НастройкиУчетаПроизводственныхЗатратРабочиеЦентры.Ссылка.Организация = &Организация
	|	И Лико_НастройкиУчетаПроизводственныхЗатратРабочиеЦентры.РабочийЦентр = &РабочийЦентр
	|	И Лико_НастройкиУчетаПроизводственныхЗатратРабочиеЦентры.Ссылка.ДатаНачала < &Дата";
	Запрос.УстановитьПараметр("Организация",Организация );
	Запрос.УстановитьПараметр("РабочийЦентр",РабочийЦентр );
	Запрос.УстановитьПараметр("Дата",?(ЗначениеЗаполнено(Дата),Дата,ТекущаяДата()));		
     Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");	
КонецФункции //-Лико m.shenderov 30.11.2018
